Evaluating: 'console.log(nodelist)'
stdout> HTMLCollection(1) [select#sel, sel: select#sel]  //  named=4

Evaluating: 'console.log(htmlcollection)'
stdout> HTMLCollection(0) []  //  named=2

Evaluating: 'console.log(options)'
stdout> HTMLOptionsCollection(2) [option, option, selectedIndex: 0]  //  named=7

Evaluating: 'console.log(all)'
stdout> HTMLAllCollection(11) [html, head, body, div.c1.c2.c3, form#f, select#sel, option, option, input, input, script, f: form#f, sel: select#sel, x: HTMLCollection(2)]  //  named=16

Evaluating: 'console.log(formControls)'
stdout> HTMLFormControlsCollection(3) [select#sel, input, input, sel: select#sel, x: RadioNodeList(2)]  //  named=7

Evaluating: 'console.log(radioNodeList)'
stdout> RadioNodeList(2) [input, input, value: '']  //  named=6

Evaluating: 'console.log(arrayX)'
stdout> (2) [1, Array(2)]  //  named=4

Evaluating: 'console.log(nonArray)'
stdout> NonArrayWithLength {keys: Array(0)}  //  named=3

Evaluating: 'console.log(generateArguments(1, "2"))'
stdout> Arguments(2) [1, '2', callee: ƒ, Symbol(Symbol.iterator): ƒ]  //  named=5

Evaluating: 'console.log(div.classList)'
stdout> DOMTokenList(3) ['c1', 'c2', 'c3', value: 'c1 c2 c3']  //  named=7

