
foo @ <eval>/VM<xx>:4:11
  > scope #0: foo
      n: 0
      > this: Window
  scope #1: Global [expensive]

bar @ <eval>/VM<xx>:13:15
  > scope #0: bar
      n: 0
      > this: Window
  scope #1: Global [expensive]
