
paused @ <eval>/VM<xx>:4:9
  > scope #0: paused
      y: 'paused'
      > this: Window
  scope #1: Global [expensive]

chained @ <eval>/VM<xx>:11:23
  > scope #0: chained
      x: 'x1'
      > this: Window
  > scope #1: Closure (chain)
      n: 1
  scope #2: Global [expensive]

chained @ <eval>/VM<xx>:11:23
  > scope #0: chained
      x: 'x2'
      > this: Window
  > scope #1: Closure (chain)
      n: 2
  scope #2: Global [expensive]

chained @ <eval>/VM<xx>:11:23
  > scope #0: chained
      x: 'x3'
      > this: Window
  > scope #1: Closure (chain)
      n: 3
  scope #2: Global [expensive]

<anonymous> @ <eval>/VM<xx>:14:15
  scope #0: Global [expensive]
